import React from "react";
import classes from "./Cards.module.scss";
import Card from "../../components/Card";

const list = [
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1 элемент списка 1", "элемент списка 2", "элемент списка 3", "элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    },
    {
        "header": "Заголовок 1",
        "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
        "text": "какой-то текст 1 текст какой-то 1 какой-то"
    }
];

const Cards = () => {
    return (
        <div>
            <h1>Страница карточек</h1>
            <div className={classes.list}>
                {list?.map((item, index) => {
                    return <Card content={item} key={`${index}${item.header}`}/>
                })}
            </div>
        </div>
    )
};

export default Cards;